OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/multiphase/interFoam/laminar/waves/waveMakerPiston/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom1
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    bottom2
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    leftwall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    rightwall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    top
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
